Autodesk.Revit.DB.PointClouds.PointCloudFilter.PrepareForCell(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Int32)
Informs the filter that a series of points within a given cell is about to be checked.
Remarks:
This is a performance hook that the filter can use to minimize computational work per TestPoint() call
within a given cell.
The engine should guarantee that all points passed to TestPoint() calls
will fall inside the (min, max) box specified here. This promise must be in effect until
the next PrepareForCell() call.
min:
The lower corner of the cell.
max:
The upper corner of the cell.
numTests:
The engine's estimate of the number of TestPoint() calls it is going to make for this cell.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.PointClouds.PointCloudFilter.TestCell(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Checks whether a given cell, i.e. a box aligned with the XYZ axes, is inside, outside
or on the border of the volume of interest.
min:
The lower corner of the cell.
max:
The upper corner of the cell.
Returns:
-1 -- The cell is entirely rejected.
0 -- The cell partially belongs to the volume of interest.  Use PrepareForCell() and TestPoint() to
evaluate individual points.
1 -- The cell is fully accepted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012